{
  "intents": [
    {
      "tag": "cumprimento",
      "patterns": [
        "Oi",
        "Olá",
        "Oi tudo jóia?",
        "E aí?",
        "Bom dia",
        "Boa tarde",
        "Boa noite",
        "Oi, como você está?",
        "Olá, tudo bem?",
        "Ei!",
        "Oi, tudo bem contigo?"
      ],
      "responses": [
        "Olá :-)",
        "Oi, obrigado por poder auxiliar",
        "Olá, no que posso ser útil?",
        "Oi, como posso te ajudar?",
        "Boa tarde! Como posso ajudar?",
        "Boa noite! Estou aqui para ajudar.",
        "Olá! Estou bem, obrigado. E você?",
        "Oi! Tudo bem por aí?",
        "Olá, estou bem, obrigado. E você?",
        "Ei! Estou aqui para ajudar.",
        "Oi! Estou bem, obrigado. E você?"
      ],
      "required": 
        "\n Segue abaixo algumas opções de palavras chaves para agilizar seu atendimento, ou se preferir digite o que deseja: \n -Reservas \n -Viagens \n -Preços \n -Falar com atendendente \n"      
    },
    {
      "tag": "reservas",
      "patterns": [
        "Oi",
        "Olá",
        "Oi tudo jóia?",
        "E aí?",
        "Bom dia",
        "Boa tarde",
        "Boa noite",
        "Oi, como você está?",
        "Olá, tudo bem?",
        "Ei!",
        "Oi, tudo bem contigo?"
      ],
      "responses": [
        "Olá :-)",
        "Oi, obrigado por poder auxiliar",
        "Olá, no que posso ser útil?",
        "Oi, como posso te ajudar?",
        "Boa tarde! Como posso ajudar?",
        "Boa noite! Estou aqui para ajudar.",
        "Olá! Estou bem, obrigado. E você?",
        "Oi! Tudo bem por aí?",
        "Olá, estou bem, obrigado. E você?",
        "Ei! Estou aqui para ajudar.",
        "Oi! Estou bem, obrigado. E você?"
      ],
      "required": 
        "\n Segue abaixo algumas opções de palavras chaves para agilizar seu atendimento, ou se preferir digite o que deseja: \n -Reservas \n -Viagens \n -Preços \n -Falar com atendendente \n"      
    },
    {
      "tag": "adeus",
      "patterns": [
        "Tchau",
        "Até breve",
        "Tchau Tchau",
        "Valeu!",
        "Até mais tarde",
        "Até logo",
        "Adeus",
        "Fui!",
        "Tenha um bom dia",
        "Até mais",
        "Até a próxima"
      ],
      "responses": [
        "Até breve, obrigado pelo seu contato!",
        "Tenha um ótimo dia!",
        "Tchau Tchau!",
        "Abraços",
        "Até mais tarde! Se precisar, estarei por aqui.",
        "Até logo! Estarei disponível se precisar de mais alguma coisa.",
        "Adeus! Foi um prazer ajudar.",
        "Até mais! Qualquer dúvida, é só chamar.",
        "Tenha um bom dia! Estarei aqui se precisar de algo mais.",
        "Até mais! Fico à disposição para ajudar.",
        "Até a próxima! Espero vê-lo novamente em breve."
      ]
    },
    {
      "tag": "obrigado",
      "patterns": [
        "Obrigado",
        "Muito obrigado",
        "Agradecido",
        "Obrigada",
        "Muito obrigada",
        "Grato",
        "Valeu"
      ],
      "responses": [
        "Fico feliz em ajudar!",
        "Qualquer coisa, estou à disposição!",
        "Eu quem agradeço!",
        "De nada! Estou aqui para ajudar.",
        "É um prazer poder ajudar!",
        "Sempre que precisar, estou à disposição!",
        "Obrigado você por confiar em mim!",
        "Estou feliz por poder ajudar!"
      ]
    },
    {
      "tag": "viagem",
      "patterns": [
        "Me indique uma viagem",
        "Quais viagens você tem?",
        "O que você faz?",
        "Quero viajar",
        "Gostaria de uma viagem",
        "Dicas de viagem",
        "Qual o seu destino dos sonhos?",
        "Quero explorar novos lugares",
        "Estou pensando em viajar",
        "Onde você me levaria?",
        "Como faço para planejar uma viagem?",
        "Você tem sugestões de destinos para lua de mel?",
        "Pode me ajudar a encontrar passagens aéreas baratas?",
        "Qual é a melhor época para visitar Paris?",
        "Conhece alguma agência de viagens confiável?",
        "Como posso economizar em minhas viagens?",
        "Quais destinos são populares nesta temporada?",
        "Você tem dicas para viajar com crianças?",
        "Gostaria de saber mais sobre viagens de aventura",
        "Pode me recomendar um hotel em Barcelona?",
        "Quais são as atrações turísticas imperdíveis em Nova York?",
        "Quanto custa uma viagem para a Europa?",
        "Você conhece alguma empresa de aluguel de carros confiável?",
        "Quais documentos eu preciso para viajar internacionalmente?",
        "Você já viajou para algum lugar exótico?",
        "Qual é o destino mais remoto que você conhece?",
        "Posso confiar em sites de reservas de hotéis online?",
        "Quais são os requisitos de visto para viajar para o Japão?",
        "Você tem dicas para evitar o jet lag?",
        "Gostaria de fazer uma viagem cultural",
        "Quero explorar locais históricos",
        "Estou interessado em viagens gastronômicas",
        "Quero fazer uma viagem de ecoturismo",
        "Procuro por destinos de praia",
        "Estou pensando em uma viagem de lua de mel",
        "Quero conhecer novas culturas",
        "Estou buscando uma viagem relaxante",
        "Gostaria de fazer um cruzeiro",
        "Quero viajar para um festival famoso",
        "Estou interessado em viagens de aventura",
        "Procuro por destinos de esqui",
        "Estou pensando em uma viagem de safári",
        "Quero fazer uma viagem de mergulho",
        "Gostaria de uma viagem de peregrinação",
        "Quero explorar destinos subterrâneos",
        "Estou buscando uma viagem de observação de animais selvagens"
      ],
      "responses": [
        "Sou seu assistente de viagens, gostaria de ir para onde?",
        "Quais destinos você deseja?",
        "Que tipo de viagem gostaria de realizar?",
        "Posso ajudar com sugestões de destinos!",
        "Explorar novos lugares é sempre uma ótima ideia! Para onde você está pensando em ir?",
        "Posso sugerir algumas opções de viagem se quiser!",
        "Eu posso ajudar com isso. Para onde você está pensando em ir?",
        "Planejar uma viagem pode ser emocionante! Qual é o seu destino dos sonhos?",
        "Lua de mel é uma ocasião especial. Posso sugerir alguns destinos românticos.",
        "Posso ajudar a encontrar ótimas ofertas de passagens!",
        "Paris é maravilhosa em qualquer época, mas a primavera é especialmente encantadora.",
        "Conheço algumas agências de viagens bem recomendadas.",
        "Economizar em viagens é importante. Posso dar algumas dicas.",
        "Alguns destinos populares atualmente incluem Bali, Tóquio e Barcelona.",
        "Viajar com crianças requer um pouco de planejamento. Posso dar algumas sugestões.",
        "Viagens de aventura são emocionantes! Posso recomendar algumas opções.",
        "Em Barcelona, o Hotel Castanhola é muito bem avaliado pelos viajantes.",
        "Nova York tem muitas atrações! Posso fazer algumas recomendações.",
        "O custo de uma viagem para a Europa pode variar dependendo de diversos fatores.",
        "Conheço algumas empresas de aluguel de carros confiáveis. Posso compartilhar algumas opções com você.",
        "Os documentos necessários para viajar internacionalmente geralmente incluem passaporte válido e, em alguns casos, visto.",
        "Embora eu não viaje fisicamente, estou familiarizado com diversos destinos.",
        "Um dos destinos mais remotos que conheço é a ilha de Páscoa, no Chile.",
        "Sites de reservas de hotéis online podem ser confiáveis, mas é importante verificar as avaliações e políticas.",
        "Os requisitos de visto para viajar para o Japão podem variar de acordo com a nacionalidade do viajante. Recomendo verificar com o consulado japonês.",
        "Algumas dicas para evitar o jet lag incluem manter-se hidratado, ajustar gradualmente o horário de sono antes da viagem e tentar se expor à luz do sol no destino.",
        "Claro, posso sugerir alguns destinos culturais incríveis!",
        "Que tal explorar a história em destinos como Roma, Atenas ou Cairo?",
        "Viagens gastronômicas são ótimas para experimentar novos sabores e culturas!",
        "Para ecoturismo, recomendo destinos como a Floresta Amazônica, Costa Rica ou Nova Zelândia.",
        "Destinos de praia oferecem relaxamento e diversão ao sol. Que tal Bali, Maldivas ou Hawaii?",
        "Lua de mel é uma ocasião especial! Posso sugerir destinos românticos como Santorini, Maldivas ou Bora Bora.",
        "Conhecer novas culturas é uma experiência enriquecedora! Que tal explorar a Ásia, Europa ou América Latina?",
        "Para uma viagem relaxante, destinos como as Ilhas Seychelles, Bali ou Costa Amalfitana são perfeitos!",
        "Cruzeiros oferecem uma variedade de destinos e atividades a bordo. Vamos planejar um?",
        "Há muitos festivais famosos ao redor do mundo, como o Carnaval do Rio de Janeiro, Oktoberfest em Munique ou Festival de Glastonbury.",
        "Viagens de aventura oferecem adrenalina e emoção! Que tal rafting no Rio Colorado, trekking no Himalaia ou escalada na Patagônia?",
        "Destinos de esqui populares incluem Aspen, Whistler e Chamonix. Pronto para algumas pistas?",
        "Um safári na África é uma experiência única para observar animais selvagens em seu habitat natural.",
        "Mergulho em recifes de coral, naufrágios ou destinos como a Grande Barreira de Corais são imperdíveis para os amantes do mar!",
        "Viagens de peregrinação podem ser espirituais e significativas. Lugares como Jerusalém, Lourdes ou Meca são destinos comuns para peregrinos.",
        "Destinos subterrâneos oferecem uma perspectiva única e fascinante. Que tal explorar cavernas em Carlsbad ou grutas na Islândia?",
        "Para observação de animais selvagens, destinos como Serengeti na Tanzânia, Pantanal no Brasil ou Galápagos no Equador são incríveis!"
      ]
    },
    {
      "tag": "pagamento",
      "patterns": [
        "Como posso pagar?",
        "Quais os métodos de pagamento?",
        "Você aceita pix?",
        "Aceita cartão de crédito?",
        "Tem desconto à vista?",
        "Posso pagar em dinheiro?",
        "Quais são as opções de parcelamento?",
        "Há alguma taxa extra para determinado método de pagamento?",
        "É seguro fazer o pagamento online?",
        "Como posso garantir a segurança do meu pagamento?"
      ],
      "responses": [
        "Aceitamos boleto, cartão de crédito, pix e também cartão de débito!",
        "Aceitamos a maioria dos métodos de pagamento (cartões, boleto e pix)",
        "Sim, aceitamos pix como forma de pagamento!",
        "Sim, aceitamos cartão de crédito como forma de pagamento!",
        "Oferecemos desconto para pagamento à vista em dinheiro!",
        "Sim, é possível pagar em dinheiro.",
        "Temos opções de parcelamento em até 4 vezes sem juros.",
        "Não há taxa extra para nenhum dos métodos de pagamento disponíveis.",
        "Sim, nosso sistema de pagamento online é altamente seguro e protegido.",
        "Você pode garantir a segurança do seu pagamento mantendo seus dados de pagamento confidenciais e verificando a segurança do site durante o processo de pagamento."
      ]
    },
    {
      "tag": "reserva",
      "patterns": [
        "Gostaria de realizar uma reserva",
        "Quero fazer uma reserva",
        "Agendar uma viagem",
        "Quero agendar para o dia",
        "Preciso reservar um quarto",
        "Quero garantir minha reserva",
        "Como faço para reservar?",
        "Posso reservar uma mesa para hoje à noite?",
        "Quero marcar um horário",
        "Fazer reserva de hotel",
        "Quero reservar um voo",
        "Como posso reservar um carro alugado?",
        "Posso reservar um passeio turístico com você?",
        "Quero garantir meu lugar em um evento",
        "Preciso reservar um lugar para uma reunião",
        "Posso fazer uma reserva para um show?"
      ],
      "responses": [
        "Claro, me informe os dias desejados",
        "Ok, me informe a melhor data para sua viagem",
        "Claro, reservarei nos dias informados",
        "Para reservar um quarto, por favor, me informe as datas desejadas.",
        "Você pode garantir sua reserva fornecendo as datas desejadas.",
        "Para reservar, basta me informar as datas e o tipo de quarto desejado.",
        "Sim, posso ajudá-lo a reservar uma mesa. Para quantas pessoas e para que horário?",
        "Você gostaria de marcar um horário para algum serviço específico?",
        "Para reservar um hotel, preciso das datas de check-in e check-out.",
        "Vou precisar de mais informações para reservar um voo. Para onde e em que data você deseja voar?",
        "Para reservar um carro alugado, preciso saber as datas e o local de retirada e devolução do veículo.",
        "Sim, posso ajudá-lo a reservar um passeio turístico. Qual destino e data você tem em mente?",
        "Para garantir seu lugar em um evento, preciso das informações sobre o evento e as suas preferências de assento, se aplicável.",
        "Para reservar um lugar para uma reunião, por favor, me informe a data, horário e número de participantes.",
        "Sim, posso ajudá-lo a fazer uma reserva para um show. Qual é o nome do evento e a data desejada?"
      ]
    },
    {
      "tag": "aventura",
      "patterns": [
        "Viagem de aventura",
        "Esportes radicais",
        "Desafios",
        "Quero uma experiência emocionante",
        "Procuro por atividades radicais",
        "Onde posso encontrar aventura?",
        "Estou buscando por adrenalina"
      ],
      "responses": [
        "Em Brotas/SP temos várias tirolesas, rafting, arvorismo, e muito mais!",
        "Que tal fazer bungee jumping em Boituva?",
        "Você pode explorar trilhas emocionantes na Chapada Diamantina na Bahia.",
        "No Rio de Janeiro, você pode fazer voo livre na Pedra Bonita ou surfar nas praias da cidade.",
        "Em Foz do Iguaçu, você pode experimentar o rafting nas corredeiras do Rio Iguaçu.",
        "A região de Bonito, no Mato Grosso do Sul, é famosa por suas cavernas e mergulhos em águas cristalinas.",
        "Em Florianópolis, você pode praticar sandboard nas dunas da Joaquina ou fazer trilhas na Mata Atlântica.",
        "A região de Jalapão, no Tocantins, oferece cachoeiras incríveis e dunas para praticar sandboard.",
        "Na Chapada dos Veadeiros, em Goiás, você pode fazer rapel em cachoeiras e trilhas pela natureza exuberante.",
        "No interior de São Paulo, você pode fazer paraquedismo em Boituva ou saltar de parapente em Atibaia."
      ]
    },
    {
      "tag": "relaxar",
      "patterns": [
        "Estou precisando de uma viagem para relaxar",
        "Gostaria de fazer uma viagem de spa",
        "Quero um retiro de yoga",
        "Estou buscando destinos tranquilos",
        "Preciso de uma escapada para recarregar as energias",
        "Quero fazer uma viagem para meditar",
        "Procuro por um resort all-inclusive",
        "Quero relaxar em uma praia paradisíaca",
        "Estou pensando em uma viagem para um destino de montanha tranquilo",
        "Gostaria de uma viagem para desestressar",
        "Procuro por destinos com águas termais",
        "Quero fazer uma viagem para um destino isolado",
        "Estou buscando por retiros espirituais",
        "Preciso de uma viagem para desconectar",
        "Quero relaxar em meio à natureza",
        "Estou interessado em fazer uma viagem de bem-estar",
        "Procuro por destinos com paisagens serenas"
      ],
      "responses": [
        "Uma viagem de spa pode ser perfeita para relaxar e rejuvenescer. Recomendo destinos como Bali, Toscana ou Tailândia.",
        "Em um retiro de yoga, você pode encontrar paz e tranquilidade. Locais populares incluem Índia, Costa Rica e Bali.",
        "Para uma escapada tranquila, sugiro destinos como as Ilhas Maldivas, Seychelles ou Bora Bora.",
        "Meditar em locais como Kyoto no Japão, Ubud em Bali ou Machu Picchu no Peru pode ser uma experiência transformadora.",
        "Resorts all-inclusive oferecem comodidade e relaxamento. Que tal Riviera Maya, Maldivas ou Ilhas Fiji?",
        "Relaxe em praias paradisíacas como Tulum no México, Maldivas ou Seychelles.",
        "Destinos de montanha como os Alpes Suíços, Rocky Mountains ou Dolomitas na Itália oferecem paz e serenidade.",
        "Para desestressar, recomendo destinos como Costa Amalfitana na Itália, Santorini na Grécia ou Napa Valley na Califórnia.",
        "Desfrute de águas termais em destinos como Reykjavik na Islândia, Rotorua na Nova Zelândia ou Banff no Canadá.",
        "Desconecte-se em destinos isolados como Ilha de Páscoa, Ilhas Faroe ou Ilha Norfolk.",
        "Retiros espirituais em locais como Varanasi na Índia, Sedona nos EUA ou Machu Picchu no Peru podem proporcionar paz interior.",
        "Desconecte-se do mundo em destinos como as Ilhas Seychelles, Patagônia na Argentina ou Parque Nacional de Yosemite nos EUA.",
        "Para relaxar em meio à natureza, considere destinos como Costa Rica, Nova Zelândia ou Noruega.",
        "Desfrute de spas de classe mundial e terapias de bem-estar em destinos como Bali, Tailândia ou Havaí.",
        "Desfrute de paisagens serenas em lugares como Santorini na Grécia, Hallstatt na Áustria ou Lago Bled na Eslovênia."
      ]
    },
    {
      "tag": "urbano",
      "patterns": [
        "Gostaria de fazer uma viagem urbana",
        "Quero explorar uma cidade",
        "Estou buscando destinos cosmopolitas",
        "Quero visitar uma metrópole",
        "Procuro por destinos com vida noturna agitada",
        "Estou interessado em cultura urbana",
        "Quero fazer uma viagem para uma capital",
        "Estou pensando em uma escapada para uma cidade movimentada",
        "Gostaria de explorar bairros históricos",
        "Procuro por destinos com arquitetura moderna",
        "Quero fazer um passeio de compras em uma grande cidade",
        "Estou buscando por experiências gastronômicas urbanas",
        "Quero visitar museus e galerias de arte",
        "Estou interessado em fazer um tour pela cena musical de uma cidade",
        "Procuro por destinos com muitas opções de entretenimento",
        "Quero fazer uma viagem para experimentar a diversidade cultural de uma cidade"
      ],
      "responses": [
        "Explorar uma cidade é uma ótima ideia! Posso sugerir destinos como Nova York, Tóquio ou Londres.",
        "Destinos cosmopolitas oferecem uma mistura emocionante de cultura, gastronomia e entretenimento. Recomendo lugares como Paris, Berlim ou Singapura.",
        "Metrópoles como São Paulo, Nova York ou Tóquio são repletas de vida e atividades para todos os gostos.",
        "Vida noturna agitada pode ser encontrada em cidades como Ibiza, Las Vegas ou Rio de Janeiro.",
        "Descubra cultura urbana em destinos como Nova Orleans, Barcelona ou Melbourne.",
        "Visite uma capital como Paris, Roma ou Buenos Aires para uma experiência urbana completa.",
        "Uma escapada para uma cidade movimentada como Chicago, Sydney ou Barcelona pode ser revigorante.",
        "Bairros históricos como o Quartier Latin em Paris, o Bairro Gótico em Barcelona ou o Distrito de Alfama em Lisboa são fascinantes para explorar.",
        "Descubra arquitetura moderna em cidades como Dubai, Singapura ou Chicago.",
        "Desfrute de um passeio de compras em metrópoles como Nova York, Milão ou Tóquio.",
        "Experimente experiências gastronômicas urbanas em destinos como Paris, Bangkok ou Barcelona.",
        "Visite museus renomados e galerias de arte em cidades como Nova York, Paris ou Florença.",
        "Faça um tour pela cena musical em cidades como Nashville, Austin ou Londres.",
        "Encontre entretenimento em abundância em destinos como Las Vegas, Dubai ou Hong Kong.",
        "Experimente a diversidade cultural em cidades como Toronto, Berlim ou Cidade do Cabo."
      ]
    }
  ]
}